
Objectives

- Add a new column to a DataFrame with a chosen name
- Understand that operations work element-wise (no loops required)
- Rename an existing column

Content to cover

- df[“...”] = f(other column)
- df[“...”] = f(other columns), eg. df[“...”]  + df[“...”]
- df.rename

In [29]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
%matplotlib inline

In [30]:
air_quality = pd.read_csv("../data/air_quality_no2.csv", 
                          index_col=0, parse_dates=True)
air_quality.head()

                     station_antwerp  station_paris  station_london
datetime
2019-04-09 03:00:00             22.5           24.4            67.0
2019-04-09 04:00:00             53.5           27.4            67.0
2019-04-09 05:00:00             54.5           34.2            41.0
2019-04-09 06:00:00             34.5           48.5            41.0
2019-04-09 07:00:00             46.5           59.5            41.0

## Add new columns

![](../schemas/05_newcolumn_1.svg)

> I want to express the $NO_2$ concentration of the station in London in mg/m$^3$ (conversion factor 1.882)

(_Assume temperature of 25 degrees Celsius and pressure of 1013 hPa. The molecular weight of $NO_2$ is 46.01 g/mol, resulting in 1 ppm $NO_2$ being equivalent to 1.882 mg/m$^3$_)

In [31]:
air_quality["london_mg_per_cubic"] = air_quality["station_london"] * 1.882
air_quality.head()

,station_antwerp,station_paris,station_london,london_mg_per_cubic
datetime,,,,
2019-04-09 03:00:00,22.5,24.4,67.0,126.094
2019-04-09 04:00:00,53.5,27.4,67.0,126.094
2019-04-09 05:00:00,54.5,34.2,41.0,77.162
2019-04-09 06:00:00,34.5,48.5,41.0,77.162
2019-04-09 07:00:00,46.5,59.5,41.0,77.162

To create a new column, use the `[]` brackets with the new column name at the left side of the assignment. When familiar to Python dictionaries, the syntax is similar to adding new key/value combinations.

<div class="alert alert-info">
    
__Note__: The calculation of the values is done __element_wise__. This means all values in the given column are multiplied by the value 1.882 at once. You do not need to use a loop to iterate each of the rows!

</div>

![](../schemas/05_newcolumn_2.svg)

> I want to check the ratio of the values in Paris versus Antwerp and save the result in a new column

In [32]:
air_quality["ratio_paris_antwerp"] = air_quality["station_paris"] / air_quality["station_antwerp"]
air_quality.head()

,station_antwerp,station_paris,station_london,london_mg_per_cubic,ratio_paris_antwerp
datetime,,,,,
2019-04-09 03:00:00,22.5,24.4,67.0,126.094,1.084444
2019-04-09 04:00:00,53.5,27.4,67.0,126.094,0.512150
2019-04-09 05:00:00,54.5,34.2,41.0,77.162,0.627523
2019-04-09 06:00:00,34.5,48.5,41.0,77.162,1.405797
2019-04-09 07:00:00,46.5,59.5,41.0,77.162,1.279570

The calculation is again element-wise, so the `/` is applied _for the values in each row_. Also other mathematical operators (+, -, *, /) or logical operators (<, >, =,...) work element wise. The latter was already used in the [subset data tutorial](./3_subset_data.ipynb) to filter rows of a table using a conditional expression.

> I want to rename the data columns to the corresponding station identifiers used by openAQ

In [34]:
air_quality_renamed = air_quality.rename(columns = {"station_antwerp": "BETR801", 
                                                    "station_paris": "FR04014",
                                                    "station_london": "London Westminster"})

In [35]:
air_quality_renamed.head()

,BETR801,FR04014,London Westminster,london_mg_per_cubic,ratio_paris_antwerp
datetime,,,,,
2019-04-09 03:00:00,22.5,24.4,67.0,126.094,1.084444
2019-04-09 04:00:00,53.5,27.4,67.0,126.094,0.512150
2019-04-09 05:00:00,54.5,34.2,41.0,77.162,0.627523
2019-04-09 06:00:00,34.5,48.5,41.0,77.162,1.405797
2019-04-09 07:00:00,46.5,59.5,41.0,77.162,1.279570

The `rename` function can be used for both row labels as column names. Provide a dictionary with the keys the current names and the values the new names to update the corresponding names.

The mapping should not be restricted to fixed names only, but can be a mapping function as well. For example, converting the column names to lower case letters can be done using an anonymous function as well:

In [43]:
air_quality_renamed = air_quality_renamed.rename(columns = lambda x: x.lower())
air_quality_renamed.head()

,betr801,fr04014,london westminster,london_mg_per_cubic,ratio_paris_antwerp
datetime,,,,,
2019-04-09 03:00:00,22.5,24.4,67.0,126.094,1.084444
2019-04-09 04:00:00,53.5,27.4,67.0,126.094,0.512150
2019-04-09 05:00:00,54.5,34.2,41.0,77.162,0.627523
2019-04-09 06:00:00,34.5,48.5,41.0,77.162,1.405797
2019-04-09 07:00:00,46.5,59.5,41.0,77.162,1.279570

## REMEMBER

- Create a new column by assigning the output to the DataFrame with a new column name in between the `[]`.
- Operations are element-wise, no need to loop over rows.
- Use `rename` with a diwtionary or function to rename row labels or column names.